package com.walking.intensive.chapter2.task10;

/**
 * Реализуйте метод isPalindrome(), который проверяет, является ли строка палиндромом.
 *
 * <p>Метод должен игнорировать пунктуацию, пробелы и регистр.
 *
 * <p>P.S. Мой любимый палиндром: Муза! Ранясь шилом опыта, ты помолишься на разум.
 *
 * <p><a href="https://github.com/KFalcon2022/intensive-tasks-2024/blob/master/README.md">Требования к оформлению</a>
 */
public class Task10 {
    public static void main(String[] args) {
//        Для собственных проверок можете делать любые изменения в этом методе
        System.out.println(isPalindrome("Appa"));
    }

    static boolean isPalindrome(String inputString) {
        if (inputString == null || inputString.length() <= 1) {
            return false;
        }

        String punctReducedString = inputString.replaceAll("[\\p{Punct}&\\p{Space}\r\n]", "");
        punctReducedString = punctReducedString.toLowerCase();
        String reverseString = "";

        int reducedStrLength = punctReducedString.length();
        for (int i = reducedStrLength - 1; i >= 0; --i) {
            reverseString += punctReducedString.charAt(i);
        }

        return reverseString.equals(punctReducedString);
    }
}
